app/controllers/grades_controller.rb

  def index
    @grades = Grade.all
---
SELECT "grades".* FROM "grades"

  def create
    @grade = Grade.new(grade_params)

    respond_to do |format|
      if @grade.save
---
INSERT INTO "grades" ("name", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "maestro"], ["teacher_id", 1], ["created_at", "2022-05-20 23:08:47.227576"], ["updated_at", "2022-05-20 23:08:47.227576"]]

  def destroy
    @grade.destroy
---
DELETE FROM "grades" WHERE "grades"."id" = ?  [["id", 1]]

    def set_grade
      @grade = Grade.find(params[:id])
---
SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]