app/controllers/students_controller.rb

INSERT INTO "students" ("name", "last_name", "gender", "date_of_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)
    respond_to do |format|
      if @student.save

UPDATE "students" SET "name" = ?, "last_name" = ?, "gender" = ?, "date_of_birth" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "julio"], ["last_name", "gonzalez"], ["gender", "male"], ["date_of_birth", "1999-01-26 00:00:00"], ["updated_at", "2022-05-20 22:08:46.729325"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)