app/controllers/student_grades_controller.rb

  def index
    @student_grades = StudentGrade.all
---
SELECT "student_grades".* FROM "student_grades"

  def create
    @student_grade = StudentGrade.new(student_grade_params)
    respond_to do |format|
      if @student_grade.save
---
INSERT INTO "student_grades" ("student_id", "grade_id", "seccion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["student_id", 3], ["grade_id", 2], ["seccion", "hola"], ["created_at", "2022-05-20 23:35:28.230890"], ["updated_at", "2022-05-20 23:35:28.230890"]]

    def set_student_grade
      @student_grade = StudentGrade.find(params[:id])
---
SELECT  "student_grades".* FROM "student_grades" WHERE "student_grades"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]