app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)
    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("name", "last_name", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "julio"], ["last_name", "gonzalez"], ["gender", "male"], ["created_at", "2022-05-20 22:14:30.552674"], ["updated_at", "2022-05-20 22:14:30.552674"]]